charla.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>SQJobs</title>
<meta name="author" content="(Federico Mon)"/>
<link rel="stylesheet" href="./reveal.js/css/reveal.css"/>
<link rel="stylesheet" href="./reveal.js/css/theme/league.css" id="theme"/>
<link rel="stylesheet" href="./custom.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1>SQJobs</h1>
<h2>Federico Mon</h2>
<h2><a href="mailto:federico.mon@ticketea.com">federico.mon@ticketea.com</a></h2>
<h2>2015-11-21</h2>
</section>

<section>
<section id="slide-orgheadline5">
<h2 id="orgheadline5">History</h2>
<div class="outline-text-2" id="text-orgheadline5">
</div></section>
<section id="slide-orgheadline1">
<h3 id="orgheadline1">Not so far ago, Celery was used in Ticketea.</h3>
</section>
<section id="slide-orgheadline2">
<h3 id="orgheadline2">Some Split-brains happened in RabbitMQ, leading to lot of effort.</h3>
</section>
<section id="slide-orgheadline3">
<h3 id="orgheadline3">The goal was to abandon RabbitMQ and use SQS instead</h3>
</section>
<section id="slide-orgheadline4">
<h3 id="orgheadline4">For more details you can ask Iñaki or Miguel</h3>
<p>
<code>@igalarzab</code> and <code>@maraujop</code>
</p>

</section>
</section>
<section>
<section id="slide-orgheadline15">
<h2 id="orgheadline15">Intro</h2>
<div class="outline-text-2" id="text-orgheadline15">
</div></section>
<section id="slide-orgheadline6">
<h3 id="orgheadline6">Sqjobs is a simple queue jobs system.</h3>
</section>
<section id="slide-orgheadline7">
<h3 id="orgheadline7">Jobs are run asynchronously "in background"</h3>
</section>
<section id="slide-orgheadline8">
<h3 id="orgheadline8">Jobs can be run even in other machines</h3>
</section>
<section id="slide-orgheadline9">
<h3 id="orgheadline9">Because a Queue of jobs is used</h3>
</section>
<section id="slide-orgheadline10">
<h3 id="orgheadline10">Broker is the end that creates a Job</h3>
</section>
<section id="slide-orgheadline11">
<h3 id="orgheadline11">Worker is the end where the job is consumed</h3>
</section>
<section id="slide-orgheadline12">
<h3 id="orgheadline12">The worker is implemented in Python.</h3>
</section>
<section id="slide-orgheadline13">
<h3 id="orgheadline13">The broker can be Python or other.</h3>
</section>
<section id="slide-orgheadline14">
<h3 id="orgheadline14">The first implemented queue, is SQS.</h3>
</section>
</section>
<section>
<section id="slide-orgheadline19">
<h2 id="orgheadline19">About SQS</h2>
<div class="outline-text-2" id="text-orgheadline19">
</div></section>
<section id="slide-orgheadline16">
<h3 id="orgheadline16">Job is received at least once.</h3>
</section>
<section id="slide-orgheadline17">
<h3 id="orgheadline17">But can be received several times.</h3>
</section>
<section id="slide-orgheadline18">
<h3 id="orgheadline18">So Jobs must be idempotent.</h3>

</section>
</section>
<section>
<section id="slide-orgheadline23">
<h2 id="orgheadline23">The Job</h2>
<div class="outline-text-2" id="text-orgheadline23">
</div></section>
<section id="slide-orgheadline20">
<h3 id="orgheadline20">Must be in jobs.py</h3>
</section>
<section id="slide-orgheadline21">
<h3 id="orgheadline21">Must exist models.py</h3>
</section>
<section id="slide-orgheadline22">
<h3 id="orgheadline22">Sample Job</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> sqjobs.job <span style="color: #F92672;">import</span> Job

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">DummyJob</span><span style="color: #AE81FF;">(</span>Job<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">name</span> = <span style="color: #E6DB74;">'dummy_job'</span>
    <span style="color: #FD971F;">queue</span> = <span style="color: #E6DB74;">'dummy_queue'</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">run</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">pass</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline26" data-background="#272822">
<h2 id="orgheadline26">Launching a Job</h2>
</section>
<section id="slide-orgheadline24">
<h3 id="orgheadline24">From python</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> sqjobs.connectors.dummy <span style="color: #F92672;">import</span> Dummy <span style="color: #F92672;">as</span> DummyConnector
<span style="color: #F92672;">from</span> sqjobs.brokers.broker <span style="color: #F92672;">import</span> Standard <span style="color: #F92672;">as</span> StandardConnector
<span style="color: #F92672;">from</span> myapp.jobs <span style="color: #F92672;">import</span> DummyJob

<span style="color: #FD971F;">connector</span> = DummyConnector<span style="color: #AE81FF;">()</span>
<span style="color: #FD971F;">broker</span> = StandardBroker<span style="color: #AE81FF;">(</span>connector<span style="color: #AE81FF;">)</span>
broker.add_job<span style="color: #AE81FF;">(</span>DummyJob, args, kwargs<span style="color: #AE81FF;">)</span>
</pre>
</div>

</section>
<section id="slide-orgheadline25">
<h3 id="orgheadline25">From anywhere else</h3>

</section>
</section>
<section>
<section id="slide-orgheadline32">
<h2 id="orgheadline32">Eager mode</h2>
<div class="outline-text-2" id="text-orgheadline32">
</div></section>
<section id="slide-orgheadline27">
<h3 id="orgheadline27">Eager mode is a simpler execution mode</h3>
</section>
<section id="slide-orgheadline28">
<h3 id="orgheadline28">Tasks are run synchronously</h3>
</section>
<section id="slide-orgheadline29">
<h3 id="orgheadline29">By the broker itself</h3>
</section>
<section id="slide-orgheadline30">
<h3 id="orgheadline30">So there is no need for a queue nor running workers.</h3>
</section>
<section id="slide-orgheadline31">
<h3 id="orgheadline31">Meant for development and unit testing.</h3>

</section>
</section>
<section>
<section id="slide-orgheadline35">
<h2 id="orgheadline35">The Worker</h2>
<div class="outline-text-2" id="text-orgheadline35">
</div></section>
<section id="slide-orgheadline33">
<h3 id="orgheadline33">Workers listen &#x2026;</h3>
</section>
<section id="slide-orgheadline34">
<h3 id="orgheadline34">Usage:</h3>
<div class="org-src-container">

<pre  class="src src-bash">$ python manage.py sqjobs worker $<span style="color: #FD971F;">queue_name</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline40">
<h2 id="orgheadline40">A Result-backed Job</h2>
<div class="outline-text-2" id="text-orgheadline40">
</div></section>
<section id="slide-orgheadline36">
<h3 id="orgheadline36">Status of the job is stored in a database.</h3>
</section>
<section id="slide-orgheadline37">
<h3 id="orgheadline37">It uses a Django model, so Django's ORM is used.</h3>
</section>
<section id="slide-orgheadline38">
<h3 id="orgheadline38">Can be used, for example, in a web application, to know when the job is done or fails, and act accordingly.</h3>

</section>
<section id="slide-orgheadline39">
<h3 id="orgheadline39">Sample ResultJob</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> sqjobs.contrib.django.djsqjobs.result_job <span style="color: #F92672;">import</span> ResultJob

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">DummyResultJob</span><span style="color: #AE81FF;">(</span>ResultJob<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">name</span> = <span style="color: #E6DB74;">'dummy_result_job'</span>
    <span style="color: #FD971F;">queue</span> = <span style="color: #E6DB74;">'dummy_queue'</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">run</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">pass</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline46">
<h2 id="orgheadline46">A Periodic task</h2>
<div class="outline-text-2" id="text-orgheadline46">
</div></section>
<section id="slide-orgheadline41">
<h3 id="orgheadline41">Will be executed like if they were in a crontab.</h3>
</section>
<section id="slide-orgheadline42">
<h3 id="orgheadline42">This requires another piece of software</h3>
<p>
called <code>Beater</code>
</p>
</section>
<section id="slide-orgheadline43">
<h3 id="orgheadline43">Cron ranges can be localized to a timezone</h3>
</section>
<section id="slide-orgheadline44">
<h3 id="orgheadline44">And support daylight saving changes.</h3>
</section>
<section id="slide-orgheadline45">
<h3 id="orgheadline45">Sample PeriodicJob</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> djsqjobs <span style="color: #F92672;">import</span> PeriodicJob

<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">DummyPeriodicJob</span><span style="color: #AE81FF;">(</span>PeriodicJob<span style="color: #AE81FF;">)</span>:
    <span style="color: #FD971F;">name</span> = <span style="color: #E6DB74;">"..."</span>
    <span style="color: #FD971F;">schedule</span> = <span style="color: #E6DB74;">"1 0 * * *"</span>
    <span style="color: #FD971F;">timezone</span> = <span style="color: #E6DB74;">"Europe/Madrid"</span>
    <span style="color: #FD971F;">created_on</span> = datetime.today<span style="color: #AE81FF;">()</span>
    <span style="color: #FD971F;">next_execution</span> = datetime.now<span style="color: #AE81FF;">()</span> + <span style="color: #AE81FF;">10</span> seconds
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline49">
<h2 id="orgheadline49">The Beater</h2>
<div class="outline-text-2" id="text-orgheadline49">
</div></section>
<section id="slide-orgheadline47">
<h3 id="orgheadline47">A special broker that will analyze and queue jobs at the right moment.</h3>
</section>
<section id="slide-orgheadline48">
<h3 id="orgheadline48">Usage:</h3>
<div class="org-src-container">

<pre  class="src src-bash">$ python manage.py sqjobs beater $<span style="color: #FD971F;">queue_name</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline52">
<h2 id="orgheadline52">Set up and Tear down</h2>
<div class="outline-text-2" id="text-orgheadline52">
</div></section>
<section id="slide-orgheadline50">
<h3 id="orgheadline50">Job execution is divided in three different stages:</h3>
<p>
<code>set_up</code>, <code>run</code>, <code>tear_down</code>
</p>
<ul class="fragment appear">
<li>Only <code>run</code> is mandatory</li>
<li><code>set_up</code> would be called before run if exists</li>
<li>And <code>tear_down</code> right after <code>run</code> if exists.</li>

</ul>

</section>
<section id="slide-orgheadline51">
<h3 id="orgheadline51">Sample Job</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> abc <span style="color: #F92672;">import</span> abstractmethod, ABCMeta
<span style="color: #F92672;">from</span> six <span style="color: #F92672;">import</span> add_metaclass

<span style="color: #66D9EF;">@add_metaclass</span><span style="color: #AE81FF;">(</span>ABCMeta<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">TimedJob</span><span style="color: #AE81FF;">(</span>Job<span style="color: #AE81FF;">)</span>:

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">set_up</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">super</span><span style="color: #AE81FF;">(</span>TimedJob, <span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>.set_up<span style="color: #AE81FF;">(</span>*args, **kwargs<span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">self</span>.start_time = datetime.now<span style="color: #AE81FF;">()</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">tear_down</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #FD971F;">end_time</span> = datetime.now<span style="color: #AE81FF;">()</span>
        <span style="color: #FD971F;">delta</span> = end_time - <span style="color: #F92672;">self</span>.start_time
        logger.log<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'%s finished in %d seconds'</span> % <span style="color: #66D9EF;">(</span><span style="color: #F92672;">self</span>.name, <span style="color: #A6E22E;">(</span>delta * <span style="color: #AE81FF;">1000</span><span style="color: #A6E22E;">)</span>.seconds<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">super</span><span style="color: #AE81FF;">(</span>TimedJob, <span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>.tear_down<span style="color: #AE81FF;">(</span>*args, **kwargs<span style="color: #AE81FF;">)</span>

    <span style="color: #66D9EF;">@abstractmethod</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">run</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">raise</span> <span style="color: #66D9EF;">NotImplementedError</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-orgheadline55">
<h2 id="orgheadline55">Failure and Success</h2>
<div class="outline-text-2" id="text-orgheadline55">
</div></section>
<section id="slide-orgheadline53">
<h3 id="orgheadline53">We can define failure and success methods</h3>
<p>
 <code>on_success</code> and <code>on_failure</code> methods will be called
depending on the output of our job execution.
</p>

</section>
<section id="slide-orgheadline54">
<h3 id="orgheadline54">Example of <code>on_success</code> and <code>on_failure</code></h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #F92672;">from</span> abc <span style="color: #F92672;">import</span> abstractmethod, ABCMeta
<span style="color: #F92672;">from</span> six <span style="color: #F92672;">import</span> add_metaclass

<span style="color: #66D9EF;">@add_metaclass</span><span style="color: #AE81FF;">(</span>ABCMeta<span style="color: #AE81FF;">)</span>
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">LoggerJob</span><span style="color: #AE81FF;">(</span>Job<span style="color: #AE81FF;">)</span>:

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">on_success</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        logger.log<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Successfully finished job %s'</span> % <span style="color: #F92672;">self</span>.name<span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">super</span><span style="color: #AE81FF;">(</span>OdinJob, <span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>.on_success<span style="color: #AE81FF;">(</span>*args, **kwargs<span style="color: #AE81FF;">)</span>

    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">on_failure</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        logger.log<span style="color: #AE81FF;">(</span><span style="color: #E6DB74;">'Failed job %s'</span> % <span style="color: #F92672;">self</span>.name<span style="color: #AE81FF;">)</span>
        <span style="color: #F92672;">super</span><span style="color: #AE81FF;">(</span>OdinJob, <span style="color: #F92672;">self</span><span style="color: #AE81FF;">)</span>.on_failure<span style="color: #AE81FF;">(</span>*args, **kwargs<span style="color: #AE81FF;">)</span>

    <span style="color: #66D9EF;">@abstractmethod</span>
    <span style="color: #F92672;">def</span> <span style="color: #A6E22E;">run</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">self</span>, *args, **kwargs<span style="color: #AE81FF;">)</span>:
        <span style="color: #F92672;">raise</span> <span style="color: #66D9EF;">NotImplementedError</span>
</pre>
</div>
</section>
</section>
</div>
</div>
<script src="./reveal.js/lib/js/head.min.js"></script>
<script src="./reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: './reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: './reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: './reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: './reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
